In [1]:
import sqlite3

In [8]:
conn = sqlite3.connect('sql.sqlite')
conn.execute('drop table if exists test')
query = '''
CREATE TABLE test (a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER);
'''

conn.execute(query)
conn.commit()

In [10]:
data = [('Atlanta', 'Georgia', 1.05, 1), ('Talla', 'Florida', 2.6, 2), ('Saxd', 'California', 3.4,4)]
stmt  = "INSERT INTO test VALUES (?, ? ,? ,?)"
conn.executemany(stmt, data)
conn.commit()

In [12]:
stmt = 'SELECT  * FROM test'
res = conn.execute(stmt)
list(res)

[('Atlanta', 'Georgia', 1.05, 1),
 ('Talla', 'Florida', 2.6, 2),
 ('Saxd', 'California', 3.4, 4)]

In [14]:
cursor = conn.execute('SELECT  * FROM test')
res = cursor.fetchall()
res

[('Atlanta', 'Georgia', 1.05, 1),
 ('Talla', 'Florida', 2.6, 2),
 ('Saxd', 'California', 3.4, 4)]

In [16]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [18]:
import pandas as pd
pd.DataFrame(res, columns=[i[0] for i in cursor.description])

         a           b     c  d
0  Atlanta     Georgia  1.05  1
1    Talla     Florida  2.60  2
2     Saxd  California  3.40  4